# Урок 11 «Урок №11 - М3У3»
# Домашнее задание:
# В посылку можно положить ровно 7 предметов, но почта строго не принимает «стекло».
# 1. Запусти цикл for на 7 итераций.
# 2. Каждый раз спрашивай: «Что кладем в посылку?».
# 3. Если пользователь ввел слово стекло — выведи «Опасно! Пропускаем этот предмет» и используй continue.
# 4. Иначе — выведи «[Предмет] добавлен в коробку».
# 5. В конце (после цикла) выведи: «Посылка собрана и готова к отправке!».

# удачи)
# по вопросам - @gerasimenko_kv



for i in range(7):
    post=input("Что кладем в посылку? ")
    if post == "стекло":
        print("Опасно!/n")
        continue
    else:print(f"{post} добавлен в коробку/n")  
print("Посылка собрана и готова к отправке!")  