# Урок 16 «Урок №16 - М4У4»
# Домашнее задание:
# Выберите любую задачу
# Тема №1: Факториал-калькулятор

# Напишите рекурсивную функцию factorial(n), которая вычисляет факториал числа (n! = n * (n-1) * ... * 1). Базовый случай: если n <= 1, вернуть 1. Добавьте цикл while, который запрашивает у пользователя число, вызывает функцию и выводит результат. Обработайте ввод отрицательных чисел и ноль.

# Подсказка: В рекурсии обязательно проверьте условие n <= 1 перед вызовом factorial(n - 1).

def factorial(n):
    fact=1
    while n>1:
        fact=fact*n
        n=n-1
    print(fact) 

n=int(input("введите число факториала: "))
factorial(n)

n=int(input("введите число факториала: "))
factorial(n)

n=int(input("введите число факториала: "))
factorial(n)

# Тема №2: Секундомер
# Создайте программу-секундомер с функциями start(), stop() и lap(). При старте фиксируйте время через time.time().
# При остановке вычисляйте разницу. При нажатии "круг" выводите промежуточное время без остановки. Используйте time.sleep() только для имитации задержек, в реальном секундомере цикл должен проверять разницу времени.

# Подсказка: Храните время старта в глобальной переменной или передавайте её через аргументы. Для lap() вычитайте время старта из текущего time.time(). Используйте форматирование для вывода минут и секунд.

# удачи)